#include <iostream>

void printTitle() {
    std::cout << "  ██████╗ ██████╗ ██████╗ ███████╗ ███████╗██████╗ ██╗  ██╗███████╗██████╗  ███████╗\n";
    std::cout << " ██╔════╝██╔═══██╗██╔══██╗██╔════╝ ██╔════╝██╔══██╗██║  ██║██╔════╝██╔══██╗ ██╔════╝\n";
    std::cout << " ██║     ██║   ██║██║  ██║╝█████╗  █████╗  ██████╔╝███████║█████╗  ██████╔╝ █████╗  \n";
    std::cout << " ██║     ██║   ██║██║  ██║ ██╔══╝  ╚════██╗██╔═══╝ ██╔══██║██╔══╝  ██╔██═╝  ██╔══╝  \n";
    std::cout << " ╚██████╗╚██████╔╝██████╔╝ ███████╗██████╔╝██║     ██║  ██║███████╗██║ ██║ ███████╗ \n";
    std::cout << "  ╚═════╝ ╚═════╝ ╚═════╝  ╚══════╝╚═════╝ ╚═╝     ╚═╝  ╚═╝╚══════╝╚═╝ ╚═╝ ╚══════╝\n";

    std::cout << "  ████████╗███████╗███████╗████████╗ █████╗ ██████╗ ██████╗ \n";
    std::cout << "  ╚══██╔══╝██╔════╝██╔════╝╚══██╔══╝██╔══██╗██╔══██╗██╔══██╗\n";
    std::cout << "     ██║   █████╗  ███████╗   ██║   ███████║██████╔╝██████╔╝\n";
    std::cout << "     ██║   ██╔══╝  ╚════██║   ██║   ██╔══██║██╔═══╝ ██╔═══╝ \n";
    std::cout << "     ██║   ███████╗███████║   ██║   ██║  ██║██║     ██║     \n";
    std::cout << "     ╚═╝   ╚══════╝╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝     ╚═╝     \n";
}

int main() {
    printTitle();
    std::cout << "Добре дошли в приложението за електронни тестове!" << std::endl;
    std::cout << "Моля, изберете опция от менюто по-долу:" << std::endl;
    std::cout << "1. Започни нов тест" << std::endl;
    std::cout << "2. Прегледай резултати" << std::endl;
    std::cout << "3. Изход" << std::endl;

    int choice;
    std::cin >> choice;

    switch (choice) {
        case 1:
            std::cout << "Започване на нов тест..." << std::endl;
            // Тук добавете логика за започване на нов тест
            break;
        case 2:
            std::cout << "Преглед на резултати..." << std::endl;
            // Тук добавете логика за преглед на резултати
            break;
        case 3:
            std::cout << "Изход от приложението..." << std::endl;
            break;
        default:
            std::cout << "Невалиден избор. Моля, опитайте отново." << std::endl;
            break;
    }

    return 0;
}